<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Ext4magic-users] ext4magic Beta-Tests
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/ext4magic-users/2010/index.html" >
   <LINK REL="made" HREF="mailto:ext4magic-users%40lists.berlios.de?Subject=Re%3A%20%5BExt4magic-users%5D%20ext4magic%20Beta-Tests&In-Reply-To=%3C3FE9611FFC3A6B4CBEE9C38B197AE9120114BDFD72B2%40ABGEX73E.FSC.NET%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000000.html">
   
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Ext4magic-users] ext4magic Beta-Tests</H1>
    <B>ext4magic-users at lists.berlios.de</B> 
    <A HREF="mailto:ext4magic-users%40lists.berlios.de?Subject=Re%3A%20%5BExt4magic-users%5D%20ext4magic%20Beta-Tests&In-Reply-To=%3C3FE9611FFC3A6B4CBEE9C38B197AE9120114BDFD72B2%40ABGEX73E.FSC.NET%3E"
       TITLE="[Ext4magic-users] ext4magic Beta-Tests">ext4magic-users at lists.berlios.de
       </A><BR>
    <I>Sat Jul 10 16:20:08 CEST 2010</I>
    <P><UL>
        <LI>Previous message: <A HREF="000000.html">[Ext4magic-users] Welcome to the ext4maigc mailing list!
</A></li>
        
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#1">[ date ]</a>
              <a href="thread.html#1">[ thread ]</a>
              <a href="subject.html#1">[ subject ]</a>
              <a href="author.html#1">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Mit der Version 0.1.3 ist die Entwicklung soweit fortgeschritten, dass ext4magic mit Beta-Tests auf den Pr&#252;fstand der User seine Leistungsf&#228;higkeite unter Beweis stellen kann.
ext4magic wurde w&#228;hrend der Entwicklung sorgf&#228;ltig auf vielen Filesystemen getestet, dennoch ist es f&#252;r einen Einzelnen unm&#246;glich alle nur erdenklichen Filesystemoptionen zu testen und dabei alle m&#246;glichen Sonderf&#228;lle zu bedenken.
Auch sind viele dieser Filesysteme, welche w&#228;hrend der Entwicklung benutzt wurden, speziell f&#252;r diesen Zweck erstellt worden sowie m&#246;gliche Problemdateien und Problemzonen in den Filesystemdaten k&#252;nstlich hergestellt. Kurzum, dieses sind Laborbedingungen die in keinster Weise ein durch die st&#228;ndige Benutzung &#252;ber Wochen und Monate gewachsenes Filesystem repr&#228;sentieren.

Die ersten Tests haben folgende Ziele:
1. problemlose Installation auf m&#246;glichst allen Rechner pr&#252;fen
2. Pr&#252;fung der wichtigsten internen Funktionen auf Filesystemen die schon l&#228;nger in Gebauch sind
3. Pr&#252;fung inwieweit ein Normaluser mit dem Programm &#252;berhaupt zielorientiert umgehen kann
4. &#220;berpr&#252;fung allgemeines Verst&#228;ndins der Dokumentation und Ermittlung weiteren Informationsbedarf



Aufgrund einer zur Zeit nur deutschen Dokumentation wird versucht f&#252;r die ersten Tests haupts&#228;chlich deutsche User anzusprechen.
Die einzelnen Tests <A HREF="http://openfacts2.berlios.de/wikide/index.php/BerliosProject:Ext4magic-Beta-test">http://openfacts2.berlios.de/wikide/index.php/BerliosProject:Ext4magic-Beta-test</A> sind sehr ausf&#252;hrlich beschrieben und sollten von jedem User mit etwas Konsolerfahrung durchf&#252;hrbar sein. Der maximale Zeitaufwand, der f&#252;r die einzelnen Tests von einem User dabei notwendig w&#228;hre, ist jeweils angegeben. Die meisten der Tests ben&#246;tigen nur wenige Minuten Interaktion und Aufmerksamkeit oder k&#246;nnen nebenbei in einem Konsolfenster ausgef&#252;hrt werden, w&#228;hrend der User zB. im Internet surft.

Jeder einzelne User-Test wird helfen, entweder die prinzipielle Funktion des Tools zu best&#228;tigen oder M&#228;ngel und Fehler zu finden. Es ist heutzutage selbstverst&#228;ndlich sich aus dem unendlichen Pool der Opensource Programme frei zu bedienen, es wird auch als selbstverst&#228;ndlich angesehen, dass jeder in Foren und beim Entwickler solcher Programme Hilfe f&#252;r all seine Probleme mit solchen Opensource Programmen findet, hier h&#228;tte jetzt jeder die M&#246;glichkeit f&#252;r sich selbst zu entscheiden, ob es auch f&#252;r ihn selbstverst&#228;ndlich ist, sich mit seinen M&#246;glichkeiten an der Entwicklung eines Opensource Programmes mit zu beteiligen. In den Filesystemen der Linuxuser herrschen genau die Bedingungen unter dem ext4magic arbeiten soll, in den K&#246;pfen der Linuxuser die individuelle Erfahrung und das Wissen, das den einzelnen Linuxuser dazu bef&#228;higt mit Hilfe einer Dokumentation auch ein f&#252;r ihn unbekanntes Programm zu benutzen. ext4magic und seine Dokumentation muss auf beides eingestellt werden, das Spezialwissen des Programmentwicklers alleine n&#252;tzt an dieser Stelle gar nichts, so dass die Weiterentwicklung von ext4magic auf die Mitwirklung und die Resonanz der Linuxuser angewiesen ist.


Die gesamte Thematik ist nicht allt&#228;glich, und oft wirklich nur eine allerletzte verzweifelte M&#246;glichkeit verlorene Daten doch noch wiederzufinden. Aber dann ist auch jegliches Versagen eines solchen Tools besonders schmerzlich. Jeder ist eingeladen entsprechend seiner M&#246;glichkeiten den einen oder anderen Test auf seinem Rechner durchzuf&#252;hren, die Gesamtsumme aller ausgef&#252;hrten Tests und die Vielfalt der dabei getestenen Filesysteme werden letztlich denen zu Gute kommen, die dieses Tool irgendwann einmal dringend ben&#246;tigen.


mailto:<A HREF="https://lists.berlios.de/mailman/listinfo/ext4magic-users">ext4magic-users at lists.berlios.de</A>  f&#252;r ihre Ergebnisse, Erfahrungen, Meinungen, Probleme und Fehlermeldungen


Danke!
       robi
          
</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000000.html">[Ext4magic-users] Welcome to the ext4maigc mailing list!
</A></li>
	
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#1">[ date ]</a>
              <a href="thread.html#1">[ thread ]</a>
              <a href="subject.html#1">[ subject ]</a>
              <a href="author.html#1">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/ext4magic-users">More information about the Ext4magic-users
mailing list</a><br>
</body></html>
